cfg/InformationRegisters/СведенияОЛицахСДополнительнымиГарантиями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияОЛицахСДополнительнымиГарантиями</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаличиеГарантий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГарантии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеГарантииВСодействииТрудоустройству</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/СведенияОЛицахСДополнительнымиГарантиями/Forms/ФормаЗаписиДополнительная/Ext/Form/Module.bsl
Процедура УстановитьДоступность()
	
	ЭлементыФормы.ВидГарантии.Доступность = НаличиеГарантий;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ФизЛицоПриОткрытии             = ФизЛицо;
	НаличиеГарантийПриОткрытии 	   = НаличиеГарантий;
	ПериодПриОткрытии              = Период;
	ВидГарантииПриОткрытии  	   = ВидГарантии;
	КомментарийПриОткрытии 		   = Комментарий;
		
	Заголовок = Заголовок + " " + ФизЛицо.Наименование;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период
	Если ФизЛицо.Пустая() Тогда
	    ФизЛицо = ФизЛицоПриОткрытии;
		Период  = ПериодПриОткрытии;
		НаличиеГарантий = Ложь;
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Если поменяли дату, то тогда новая  запись
	Если ПериодПриОткрытии <> Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если ВидГарантииПриОткрытии <> ВидГарантии ИЛИ
			КомментарийПриОткрытии <> Комментарий ИЛИ
			НаличиеГарантийПриОткрытии <> НаличиеГарантий Тогда
		
			МенеджерЗаписи = РегистрыСведений.СведенияОЛицахСДополнительнымиГарантиями.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период   = Период;
			МенеджерЗаписи.ФизЛицо  = ФизЛицо;
			МенеджерЗаписи.НаличиеГарантий		    = НаличиеГарантий;
			МенеджерЗаписи.ВидГарантии			   	= ВидГарантии;
			МенеджерЗаписи.Комментарий 		 		= Комментарий;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписи()
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","НаличиеГарантий"), ФизЛицо);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаИсторияНажатие(Элемент)
	
	ФормаРегистра = РегистрыСведений.СведенияОЛицахСДополнительнымиГарантиями.ПолучитьФормуСписка();
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.Значение = ФизЛицо;
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.ВидСравнения = ВидСравнения.Равно;
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.Использование = Истина;
	ФормаРегистра.ЭлементыФормы.РегистрСведенийСписок.НачальноеОтображениеСписка = НачальноеОтображениеСписка.Конец;
	
	ФормаРегистра.Открыть();
	
КонецПроцедуры

Процедура НаличиеГарантийПриИзменении(Элемент)
	
	Если НЕ НаличиеГарантий Тогда
		ВидГарантии = Справочники.ДополнительныеГарантииВСодействииТрудоустройству.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьДоступность();

КонецПроцедуры
